Revit 2027 API
BuiltInFailures.ZoneFailures.ZoneNotEnclosed Property
 Zone not enclosed totally.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZoneNotEnclosed { get; }
Public Shared ReadOnly Property ZoneNotEnclosed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZoneNotEnclosed {
	FailureDefinitionId^ get ();
}
static member ZoneNotEnclosed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace